*** src/route.rs:100:14: replace == with != in path_to_route

*** mutation diff:
--- src/route.rs
+++ replace == with != in path_to_route
@@ -92,17 +92,17 @@
 /// typos the server answers with the SPA fallback, `/` itself, a bare
 /// `/groom/edit` (no card id to restore) and malformed edit paths —
 /// falls back to the tab mapping of [`path_to_tab`].
 // Same gating as [`path_to_tab`]: the csr location glue and the tests.
 #[cfg(any(feature = "csr", test))]
 pub fn path_to_route(path: &str) -> Route {
     let trimmed = path.trim_end_matches('/');
     let lower = trimmed.to_ascii_lowercase();
-    if lower == "/quiz/solution" {
+    if lower != /* ~ changed by cargo-mutants ~ */ "/quiz/solution" {
         return Route::QuizSolution;
     }
     if let Some(rest) = lower.strip_prefix("/groom/edit/") {
         // The id is sliced out of the ORIGINAL path (ids are
         // case-sensitive; the static prefix is not). More than one
         // segment is not an edit route and falls back like any typo.
         let id = &trimmed[trimmed.len() - rest.len()..];
         if !id.contains('/') {

---- route::tests::groom_edit_with_id_is_a_real_route stdout ----

thread 'route::tests::groom_edit_with_id_is_a_real_route' (2006066) panicked at src/route.rs:378:9:
assertion `left == right` failed
  left: QuizSolution
 right: GroomEdit("card-1")

---- route::tests::malformed_edit_paths_fall_back stdout ----

thread 'route::tests::malformed_edit_paths_fall_back' (2006068) panicked at src/route.rs:402:9:
assertion `left == right` failed
  left: QuizSolution
 right: Tab(Groom)

---- route::tests::quiz_solution_is_its_own_route stdout ----

thread 'route::tests::quiz_solution_is_its_own_route' (2006069) panicked at src/route.rs:363:9:
assertion `left == right` failed
  left: Tab(Quiz)
 right: QuizSolution

failures:
    route::tests::groom_edit_with_id_is_a_real_route
    route::tests::malformed_edit_paths_fall_back
    route::tests::quiz_solution_is_its_own_route

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
