*** src/route.rs:107:41: replace - with + in path_to_route

*** mutation diff:
--- src/route.rs
+++ replace - with + in path_to_route
@@ -99,17 +99,17 @@
     let lower = trimmed.to_ascii_lowercase();
     if lower == "/quiz/solution" {
         return Route::QuizSolution;
     }
     if let Some(rest) = lower.strip_prefix("/groom/edit/") {
         // The id is sliced out of the ORIGINAL path (ids are
         // case-sensitive; the static prefix is not). More than one
         // segment is not an edit route and falls back like any typo.
-        let id = &trimmed[trimmed.len() - rest.len()..];
+        let id = &trimmed[trimmed.len() + /* ~ changed by cargo-mutants ~ */ rest.len()..];
         if !id.contains('/') {
             return Route::GroomEdit(id.to_owned());
         }
     }
     Route::Tab(path_to_tab(path))
 }
 
 /// Maps a URL path to a tab. Anything unknown — including typos the

---- route::tests::groom_edit_with_id_is_a_real_route stdout ----

thread 'route::tests::groom_edit_with_id_is_a_real_route' (2031070) panicked at src/route.rs:107:26:
start byte index 24 is out of bounds for string of length 18

---- route::tests::malformed_edit_paths_fall_back stdout ----

thread 'route::tests::malformed_edit_paths_fall_back' (2031072) panicked at src/route.rs:107:26:
start byte index 18 is out of bounds for string of length 15

failures:
    route::tests::groom_edit_with_id_is_a_real_route
    route::tests::malformed_edit_paths_fall_back

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
