*** src/route.rs:108:12: delete ! in path_to_route

*** mutation diff:
--- src/route.rs
+++ delete ! in path_to_route
@@ -100,17 +100,17 @@
     if lower == "/quiz/solution" {
         return Route::QuizSolution;
     }
     if let Some(rest) = lower.strip_prefix("/groom/edit/") {
         // The id is sliced out of the ORIGINAL path (ids are
         // case-sensitive; the static prefix is not). More than one
         // segment is not an edit route and falls back like any typo.
         let id = &trimmed[trimmed.len() - rest.len()..];
-        if !id.contains('/') {
+        if  /* ~ changed by cargo-mutants ~ */id.contains('/') {
             return Route::GroomEdit(id.to_owned());
         }
     }
     Route::Tab(path_to_tab(path))
 }
 
 /// Maps a URL path to a tab. Anything unknown — including typos the
 /// server answers with the SPA fallback, and `/` itself — falls back to

---- route::tests::groom_edit_with_id_is_a_real_route stdout ----

thread 'route::tests::groom_edit_with_id_is_a_real_route' (2033509) panicked at src/route.rs:378:9:
assertion `left == right` failed
  left: Tab(Quiz)
 right: GroomEdit("card-1")

---- route::tests::malformed_edit_paths_fall_back stdout ----

thread 'route::tests::malformed_edit_paths_fall_back' (2033511) panicked at src/route.rs:405:9:
assertion `left == right` failed
  left: GroomEdit("a/b")
 right: Tab(Quiz)

failures:
    route::tests::groom_edit_with_id_is_a_real_route
    route::tests::malformed_edit_paths_fall_back

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
