*** src/route.rs:132:9: delete match arm "/groom" in path_to_tab

*** mutation diff:
--- src/route.rs
+++ delete match arm "/groom" in path_to_tab
@@ -124,17 +124,17 @@
 #[cfg(any(feature = "csr", test))]
 pub fn path_to_tab(path: &str) -> Tab {
     let normalized = path.trim_end_matches('/').to_ascii_lowercase();
     let base = normalized
         .strip_suffix("/edit")
         .map_or(normalized.as_str(), |stem| stem.trim_end_matches('/'));
     match base {
         "/add" => Tab::AddCard,
-        "/groom" => Tab::Groom,
+         /* ~ changed by cargo-mutants ~ */
         "/account" => Tab::Account,
         _ => Tab::Quiz,
     }
 }
 
 /// The canonical path of a tab (inverse of [`path_to_tab`]).
 // Same gating as [`path_to_tab`]: only the csr history glue and the
 // tests need it.

---- route::tests::edit_paths_fall_back_to_the_tab_underneath stdout ----

thread 'route::tests::edit_paths_fall_back_to_the_tab_underneath' (2012108) panicked at src/route.rs:337:9:
assertion `left == right` failed
  left: Quiz
 right: Groom

---- route::tests::case_is_normalized stdout ----

thread 'route::tests::case_is_normalized' (2012107) panicked at src/route.rs:349:9:
assertion `left == right` failed
  left: Quiz
 right: Groom

---- route::tests::known_paths_map_to_their_tabs stdout ----

thread 'route::tests::known_paths_map_to_their_tabs' (2012110) panicked at src/route.rs:316:9:
assertion `left == right` failed
  left: Quiz
 right: Groom

failures:
    route::tests::case_is_normalized
    route::tests::edit_paths_fall_back_to_the_tab_underneath
    route::tests::known_paths_map_to_their_tabs
    route::tests::malformed_edit_paths_fall_back
    route::tests::tab_paths_roundtrip
    route::tests::trailing_slash_is_normalized

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
