*** src/route.rs:199:5: replace push_tab with ()

*** mutation diff:
--- src/route.rs
+++ replace push_tab with ()
@@ -191,22 +191,17 @@
 }
 
 /// Pushes the tab's path onto the history stack on a tab switch. A no-op
 /// when the URL already matches (re-clicking the active tab must not pile
 /// up duplicate history entries, and the entry created by the initial
 /// load is already right).
 #[cfg(feature = "csr")]
 pub fn push_tab(tab: Tab) {
-    let path = tab_to_path(tab);
-    if current_path() != path {
-        with_history(|history| {
-            _ = history.push_state_with_url(&wasm_bindgen::JsValue::NULL, "", Some(path));
-        });
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Rewrites the current history entry to the tab's path without adding an
 /// entry — used once at startup to canonicalize `/` to `/quiz`, and when
 /// the editor overlay closes via Save/Cancel to turn its `/edit` entry
 /// back into the tab underneath (no stale `/edit` entries on the stack).
 #[cfg(feature = "csr")]
 pub fn replace_tab(tab: Tab) {

*** result: Success
