*** src/route.rs:227:5: replace push_edit with ()

*** mutation diff:
--- src/route.rs
+++ replace push_edit with ()
@@ -219,22 +219,17 @@
 }
 
 /// Pushes the editor overlay's entry (`<tab>/edit`) when an editing
 /// session opens over a tab. One entry per session: browser Back while
 /// editing then pops just the overlay (popstate back to the tab path)
 /// instead of also navigating away from the tab.
 #[cfg(feature = "csr")]
 pub fn push_edit(tab: Tab) {
-    let path = format!("{}/edit", tab_to_path(tab));
-    if current_path() != path {
-        with_history(|history| {
-            _ = history.push_state_with_url(&wasm_bindgen::JsValue::NULL, "", Some(&path));
-        });
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Pushes the groom editor's entry (`/groom/edit/{id}`) when an edit
 /// session for a known card opens. Unlike the bare [`push_edit`] path
 /// this one is a real route: a fresh load re-opens the editor on the
 /// card. One entry per session, so browser Back closes just the overlay.
 #[cfg(feature = "csr")]
 pub fn push_groom_edit(id: &str) {

*** result: Success
