*** src/route.rs:241:5: replace push_groom_edit with ()

*** mutation diff:
--- src/route.rs
+++ replace push_groom_edit with ()
@@ -233,22 +233,17 @@
 }
 
 /// Pushes the groom editor's entry (`/groom/edit/{id}`) when an edit
 /// session for a known card opens. Unlike the bare [`push_edit`] path
 /// this one is a real route: a fresh load re-opens the editor on the
 /// card. One entry per session, so browser Back closes just the overlay.
 #[cfg(feature = "csr")]
 pub fn push_groom_edit(id: &str) {
-    let path = format!("{}/edit/{id}", tab_to_path(Tab::Groom));
-    if current_path() != path {
-        with_history(|history| {
-            _ = history.push_state_with_url(&wasm_bindgen::JsValue::NULL, "", Some(&path));
-        });
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Rewrites the current history entry to `/quiz/solution` when the quiz
 /// solution is revealed — a REPLACE, not a push: revealing must not pile
 /// up history entries, and browser Back afterwards leaves the quiz
 /// instead of merely un-revealing.
 #[cfg(feature = "csr")]
 pub fn replace_quiz_solution() {

*** result: Success
