*** src/route.rs:303:5: replace with_history with ()

*** mutation diff:
--- src/route.rs
+++ replace with_history with ()
@@ -295,19 +295,17 @@
 #[cfg(not(feature = "csr"))]
 pub fn replace_quiz_solution() {}
 
 /// Runs `f` with the browser's `history` object when available (it always
 /// is in a real browser; the graceful no-op keeps the wasm module from
 /// panicking in exotic embeddings).
 #[cfg(feature = "csr")]
 fn with_history(f: impl FnOnce(&web_sys::History)) {
-    if let Ok(history) = window().history() {
-        f(&history);
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::{Route, Tab, path_to_route, path_to_tab, tab_to_path};
 
     #[test]
     fn known_paths_map_to_their_tabs() {

*** result: Success
