*** src/route.rs:100:41: replace - with / in path_to_route

*** mutation diff:
--- src/route.rs
+++ replace - with / in path_to_route
@@ -92,17 +92,17 @@
 #[cfg(any(feature = "csr", test))]
 pub fn path_to_route(path: &str) -> Route {
     let trimmed = path.trim_end_matches('/');
     let lower = trimmed.to_ascii_lowercase();
     if let Some(rest) = lower.strip_prefix("/groom/edit/") {
         // The id is sliced out of the ORIGINAL path (ids are
         // case-sensitive; the static prefix is not). More than one
         // segment is not an edit route and falls back like any typo.
-        let id = &trimmed[trimmed.len() - rest.len()..];
+        let id = &trimmed[trimmed.len() / /* ~ changed by cargo-mutants ~ */ rest.len()..];
         if !id.contains('/') {
             return Route::GroomEdit(id.to_owned());
         }
     }
     Route::Tab(path_to_tab(path))
 }
 
 /// Maps a URL path to a tab. Anything unknown — including typos the

---- route::tests::popstate_dispatches_on_the_full_route stdout ----

thread 'route::tests::popstate_dispatches_on_the_full_route' (40208) panicked at src/route.rs:358:9:
assertion `left == right` failed
  left: Tab(Quiz)
 right: GroomEdit("card-9")

---- route::tests::groom_edit_with_id_is_a_real_route stdout ----

thread 'route::tests::groom_edit_with_id_is_a_real_route' (40204) panicked at src/route.rs:334:9:
assertion `left == right` failed
  left: Tab(Quiz)
 right: GroomEdit("card-1")

failures:
    route::tests::groom_edit_with_id_is_a_real_route
    route::tests::popstate_dispatches_on_the_full_route

test result: FAILED. 35 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
