*** src/route.rs:124:9: delete match arm "/add" in path_to_tab

*** mutation diff:
--- src/route.rs
+++ delete match arm "/add" in path_to_tab
@@ -116,17 +116,17 @@
 // defaults to Quiz without it.
 #[cfg(any(feature = "csr", test))]
 pub fn path_to_tab(path: &str) -> Tab {
     let normalized = path.trim_end_matches('/').to_ascii_lowercase();
     let base = normalized
         .strip_suffix("/edit")
         .map_or(normalized.as_str(), |stem| stem.trim_end_matches('/'));
     match base {
-        "/add" => Tab::AddCard,
+         /* ~ changed by cargo-mutants ~ */
         "/groom" => Tab::Groom,
         "/account" => Tab::Account,
         _ => Tab::Quiz,
     }
 }
 
 /// The canonical path of a tab (inverse of [`path_to_tab`]).
 // Same gating as [`path_to_tab`]: only the csr history glue and the

---- route::tests::case_is_normalized stdout ----

thread 'route::tests::case_is_normalized' (41535) panicked at src/route.rs:311:9:
assertion `left == right` failed
  left: Quiz
 right: AddCard

---- route::tests::popstate_dispatches_on_the_full_route stdout ----

thread 'route::tests::popstate_dispatches_on_the_full_route' (41541) panicked at src/route.rs:362:9:
assertion `left == right` failed
  left: Tab(Quiz)
 right: Tab(AddCard)

---- route::tests::tab_paths_roundtrip stdout ----

thread 'route::tests::tab_paths_roundtrip' (41543) panicked at src/route.rs:318:13:
assertion `left == right` failed
  left: Quiz
 right: AddCard

failures:
    route::tests::case_is_normalized
    route::tests::edit_paths_fall_back_to_the_tab_underneath
    route::tests::known_paths_map_to_their_tabs
    route::tests::popstate_dispatches_on_the_full_route
    route::tests::tab_paths_roundtrip

test result: FAILED. 32 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
