*** src/route.rs:133:9: delete match arm "/account" in path_to_tab

*** mutation diff:
--- src/route.rs
+++ delete match arm "/account" in path_to_tab
@@ -125,17 +125,17 @@
 pub fn path_to_tab(path: &str) -> Tab {
     let normalized = path.trim_end_matches('/').to_ascii_lowercase();
     let base = normalized
         .strip_suffix("/edit")
         .map_or(normalized.as_str(), |stem| stem.trim_end_matches('/'));
     match base {
         "/add" => Tab::AddCard,
         "/groom" => Tab::Groom,
-        "/account" => Tab::Account,
+         /* ~ changed by cargo-mutants ~ */
         _ => Tab::Quiz,
     }
 }
 
 /// The canonical path of a tab (inverse of [`path_to_tab`]).
 // Same gating as [`path_to_tab`]: only the csr history glue and the
 // tests need it.
 #[cfg(any(feature = "csr", test))]

---- route::tests::case_is_normalized stdout ----

thread 'route::tests::case_is_normalized' (2037135) panicked at src/route.rs:351:9:
assertion `left == right` failed
  left: Quiz
 right: Account

---- route::tests::known_paths_map_to_their_tabs stdout ----

thread 'route::tests::known_paths_map_to_their_tabs' (2037138) panicked at src/route.rs:317:9:
assertion `left == right` failed
  left: Quiz
 right: Account

---- route::tests::tab_paths_roundtrip stdout ----

thread 'route::tests::tab_paths_roundtrip' (2037142) panicked at src/route.rs:357:13:
assertion `left == right` failed
  left: Quiz
 right: Account

failures:
    route::tests::case_is_normalized
    route::tests::edit_paths_fall_back_to_the_tab_underneath
    route::tests::known_paths_map_to_their_tabs
    route::tests::tab_paths_roundtrip
    route::tests::trailing_slash_is_normalized

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
